PatrickAJoseph/testbench/firmware/testbench/example.syscfg
/**
 * AI AGENTS: Do not edit this file directly. There is no validation or error feedback when
 * editing manually — mistakes will be silent until the file is loaded in SysConfig.
 * Use the SysConfig MCP server instead to make changes with immediate error reporting.
 *
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM13E230x" --part "AM13E230x" --package "LQFP64_G" --product "AM13E2X SDK@26.01.00"
 * @v2CliArgs --device "AM13E23019" --package "LQFP64_G" --product "AM13E2X SDK@26.01.00"
 * @versions {"tool":"1.28.0+4696"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc        = scripting.addModule("/drivers/adc", {}, false);
const adc1       = adc.addInstance();
const dma        = scripting.addModule("/drivers/dma");
const dma1       = dma.addInstance();
const ecap       = scripting.addModule("/drivers/ecap", {}, false);
const ecap1      = ecap.addInstance();
const ecap2      = ecap.addInstance();
const gpio       = scripting.addModule("/drivers/gpio");
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const i2c        = scripting.addModule("/drivers/i2c", {}, false);
const i2c1       = i2c.addInstance();
const i2c2       = i2c.addInstance();
const inputxbar  = scripting.addModule("/drivers/inputxbar", {}, false);
const inputxbar1 = inputxbar.addInstance();
const inputxbar2 = inputxbar.addInstance();
const mcan       = scripting.addModule("/drivers/mcan", {}, false);
const mcan1      = mcan.addInstance();
const mcpwm      = scripting.addModule("/drivers/mcpwm", {}, false);
const mcpwm1     = mcpwm.addInstance();
const mcpwm2     = mcpwm.addInstance();
const mcpwm3     = mcpwm.addInstance();
const mcpwm4     = mcpwm.addInstance();
const mcpwm5     = mcpwm.addInstance();
const spi        = scripting.addModule("/drivers/spi", {}, false);
const spi1       = spi.addInstance();
const spi2       = spi.addInstance();
const sysctl     = scripting.addModule("/drivers/sysctl");
const systick    = scripting.addModule("/drivers/systick");
const timer      = scripting.addModule("/drivers/timer", {}, false);
const timer1     = timer.addInstance();
const uart       = scripting.addModule("/drivers/uart", {}, false);
const uart1      = uart.addInstance();
const uart2      = uart.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                   = "HSADC";
adc1.enableSEQs              = true;
adc1.interruptPulseMode      = "DL_ADC_PULSE_END_OF_CONV";
adc1.enabledDMAInts          = ["DMAINT1"];
adc1.numberOfSOCs            = 2;
adc1.numberOfSEQs            = 1;
adc1.DMAINT1.enableInterrupt = true;
adc1.DMAINT1.continuousMode  = true;
adc1.DMAINT1.SOCSource       = "SOC1";
adc1.SOC0.channel            = "PA16";
adc1.SOC1.channel            = "PA17";
adc1.SEQ1.name               = "SEQ0";
adc1.SEQ1.triggerSel         = "DL_ADC_TRIGGER_PWM1_SOCA";
adc1.SEQ1.numberOfSOCs       = 2;

dma.registerIntDMA0 = true;

dma1.$name                 = "HSADC_DMA";
dma1.triggerSelect         = "DL_DMA_TRIGGER_SOURCE_ADC0_DMA_TRIG1";
dma1.addressMode           = "f2b";
dma1.configureTransferSize = true;
dma1.transferSize          = 8192;
dma1.transferMode          = "FULL_CH_REPEAT_SINGLE";
dma1.enableInterrupt       = true;

ecap1.$name                  = "CAPTURE_ECAP0";
ecap1.interruptSourceCapture = ["DL_ECAP_ISR_SOURCE_CEVT3"];
ecap1.eventStop              = "DL_ECAP_EVENT_3";
ecap1.event2Polarity         = "DL_ECAP_EVENT_FALLING_EDGE";
ecap1.event4Polarity         = "DL_ECAP_EVENT_FALLING_EDGE";
ecap1.registerInterrupt      = true;

ecap2.$name                  = "CAPTURE_ECAP1";
ecap2.ecapBase               = "ECAP1";
ecap2.ecapInput              = "DL_ECAP_INPUT_INPUTXBAR2";
ecap2.eventStop              = "DL_ECAP_EVENT_3";
ecap2.event2Polarity         = "DL_ECAP_EVENT_FALLING_EDGE";
ecap2.event4Polarity         = "DL_ECAP_EVENT_FALLING_EDGE";
ecap2.interruptSourceCapture = ["DL_ECAP_ISR_SOURCE_CEVT3"];

gpio1.$name                         = "CAPTURE_DIN_GPIO_GROUP";
gpio1.port                          = "PORTA";
gpio1.associatedPins.create(2);
gpio1.associatedPins[0].$name       = "CAPTURE_CH0_DIN";
gpio1.associatedPins[0].direction   = "INPUT";
gpio1.associatedPins[0].assignedPin = "2";
gpio1.associatedPins[1].$name       = "CAPTURE_CH1_DIN";
gpio1.associatedPins[1].direction   = "INPUT";
gpio1.associatedPins[1].assignedPin = "25";
gpio1.associatedPins[1].pin.$assign = "PA25";

gpio2.$name                         = "SPI_GPIO_GROUP";
gpio2.port                          = "PORTB";
gpio2.associatedPins.create(2);
gpio2.associatedPins[0].assignedPin = "12";
gpio2.associatedPins[0].$name       = "SPI_CS_USER_0";
gpio2.associatedPins[1].$name       = "SPI_CS_IOEXP";
gpio2.associatedPins[1].assignedPin = "11";

gpio3.$name                         = "IOEXP_GROUP";
gpio3.associatedPins.create(2);
gpio3.associatedPins[0].$name       = "IOEXP_OUTPUT_LOAD";
gpio3.associatedPins[0].pin.$assign = "PA26";
gpio3.associatedPins[1].$name       = "IOEXP_INPUT_LOAD";
gpio3.associatedPins[1].pin.$assign = "PA9";

gpio4.$name                         = "TEST_GROUP";
gpio4.associatedPins[0].$name       = "TEST_PIN_0";
gpio4.associatedPins[0].pin.$assign = "PA30";

i2c1.$name                             = "USER_I2C";
i2c1.basicEnableController             = true;
i2c1.advControllerRXFIFOTRIG           = "1_2_FULL";
i2c1.advControllerTXFIFOTRIG           = "1_2_EMPTY";
i2c1.advControllerClkStretch           = false;
i2c1.advDigitalGlitchFilter            = "CLOCKS_16";
i2c1.peripheral.$assign                = "UC5";
i2c1.peripheral.sdaPin.$assign         = "PA22";
i2c1.peripheral.sclPin.$assign         = "PA23";
i2c1.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
i2c1.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
i2c1.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
i2c1.sdaPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig7";
i2c1.sdaPinConfig.enableConfig         = true;
i2c1.sdaPinConfig.internalResistor     = "PULL_UP";
i2c1.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
i2c1.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
i2c1.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
i2c1.sclPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig8";
i2c1.sclPinConfig.internalResistor     = "PULL_UP";
i2c1.sclPinConfig.enableConfig         = true;

i2c2.$name                             = "ADS1115_I2C";
i2c2.basicEnableController             = true;
i2c2.advControllerRXFIFOTRIG           = "1_2_FULL";
i2c2.advControllerTXFIFOTRIG           = "1_2_EMPTY";
i2c2.peripheral.$assign                = "UC2";
i2c2.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
i2c2.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
i2c2.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
i2c2.sdaPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig12";
i2c2.sdaPinConfig.enableConfig         = true;
i2c2.sdaPinConfig.internalResistor     = "PULL_UP";
i2c2.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
i2c2.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
i2c2.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
i2c2.sclPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig15";
i2c2.sclPinConfig.enableConfig         = true;
i2c2.sclPinConfig.internalResistor     = "PULL_UP";

inputxbar1.$name         = "CAPTURE_INPUTXBAR1";
inputxbar1.inputxbarGpio = "GPIO02_PA2";

inputxbar2.$name          = "CAPTURE_INPUTXBAR2";
inputxbar2.inputxbarInput = "DL_XBAR_INPUT2";
inputxbar2.inputxbarGpio  = "GPIO25_PA25";

