PatrickAJoseph/testbench/firmware/testbench/example.syscfg
mcan1.$name                            = "USER_CAN";
mcan1.peripheral.$assign               = "MCAN0";
mcan1.peripheral.txPin.$assign         = "PA12";
mcan1.peripheral.rxPin.$assign         = "PA11";
mcan1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
mcan1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
mcan1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
mcan1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
mcan1.txPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig13";
mcan1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
mcan1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
mcan1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
mcan1.rxPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig14";

mcpwm1.$name                                     = "PWM_CH0";
mcpwm1.mcpwmBase                                 = "MCPWM0";
mcpwm1.pinList                                   = ["1A"];
mcpwm1.enablePWM2A                               = false;
mcpwm1.enablePWM1B                               = false;
mcpwm1.enablePWM2B                               = false;
mcpwm1.enablePWM3A                               = false;
mcpwm1.enablePWM3B                               = false;
mcpwm1.timeBase.$name                            = "drivers_mcpwm_v0_mcpwm_timeBase0";
mcpwm1.timeBase.counterMode                      = "DL_MCPWM_COUNTER_MODE_UP";
mcpwm1.timeBase.emulationMode                    = "DL_MCPWM_EMULATION_FREE_RUN";
mcpwm1.timeBase.periodValue                      = 10000;
mcpwm1.counterCompare.$name                      = "drivers_mcpwm_v0_mcpwm_counterCompare0";
mcpwm1.counterCompare.PWM1_CMPA                  = 1000;
mcpwm1.actionQualifier.$name                     = "drivers_mcpwm_v0_mcpwm_actionQualifier0";
mcpwm1.actionQualifier.PWM1A.$name               = "drivers_mcpwm_v0_mcpwm_actionQualifierEvents0";
mcpwm1.actionQualifier.PWM1A.actionAtZero        = "DL_MCPWM_AQ_OUTPUT_HIGH";
mcpwm1.actionQualifier.PWM1A.actionAtCountUpCmpA = "DL_MCPWM_AQ_OUTPUT_LOW";
mcpwm1.loadMode.$name                            = "drivers_mcpwm_v0_mcpwm_loadMode0";
mcpwm1.peripheral["1A"].$assign                  = "PB3";

mcpwm2.$name                                     = "PWM_CH1";
mcpwm2.mcpwmBase                                 = "MCPWM4";
mcpwm2.pinList                                   = ["1B"];
mcpwm2.enablePWM1A                               = false;
mcpwm2.enablePWM2A                               = false;
mcpwm2.enablePWM3A                               = false;
mcpwm2.enablePWM2B                               = false;
mcpwm2.enablePWM3B                               = false;
mcpwm2.timeBase.$name                            = "drivers_mcpwm_v0_mcpwm_timeBase1";
mcpwm2.timeBase.counterMode                      = "DL_MCPWM_COUNTER_MODE_UP";
mcpwm2.timeBase.emulationMode                    = "DL_MCPWM_EMULATION_FREE_RUN";
mcpwm2.counterCompare.$name                      = "drivers_mcpwm_v0_mcpwm_counterCompare1";
mcpwm2.actionQualifier.$name                     = "drivers_mcpwm_v0_mcpwm_actionQualifier1";
mcpwm2.actionQualifier.PWM1B.$name               = "drivers_mcpwm_v0_mcpwm_actionQualifierEvents2";
mcpwm2.actionQualifier.PWM1B.actionAtZero        = "DL_MCPWM_AQ_OUTPUT_HIGH";
mcpwm2.actionQualifier.PWM1B.actionAtCountUpCmpB = "DL_MCPWM_AQ_OUTPUT_LOW";
mcpwm2.loadMode.$name                            = "drivers_mcpwm_v0_mcpwm_loadMode1";
mcpwm2.peripheral.$assign                        = "MCPWM4";
mcpwm2.peripheral["1B"].$assign                  = "PA7";

mcpwm3.$name                                     = "PWM_CH2";
mcpwm3.mcpwmBase                                 = "MCPWM3";
mcpwm3.pinList                                   = ["3A"];
mcpwm3.enablePWM1A                               = false;
mcpwm3.enablePWM1B                               = false;
mcpwm3.enablePWM2A                               = false;
mcpwm3.enablePWM2B                               = false;
mcpwm3.enablePWM3B                               = false;
mcpwm3.timeBase.$name                            = "drivers_mcpwm_v0_mcpwm_timeBase2";
mcpwm3.timeBase.counterMode                      = "DL_MCPWM_COUNTER_MODE_UP";
mcpwm3.timeBase.emulationMode                    = "DL_MCPWM_EMULATION_FREE_RUN";
mcpwm3.counterCompare.$name                      = "drivers_mcpwm_v0_mcpwm_counterCompare2";
mcpwm3.actionQualifier.$name                     = "drivers_mcpwm_v0_mcpwm_actionQualifier2";
mcpwm3.actionQualifier.PWM3A.$name               = "drivers_mcpwm_v0_mcpwm_actionQualifierEvents6";
mcpwm3.actionQualifier.PWM3A.actionAtZero        = "DL_MCPWM_AQ_OUTPUT_HIGH";
mcpwm3.actionQualifier.PWM3A.actionAtCountUpCmpA = "DL_MCPWM_AQ_OUTPUT_LOW";
mcpwm3.loadMode.$name                            = "drivers_mcpwm_v0_mcpwm_loadMode2";
mcpwm3.peripheral["3A"].$assign                  = "PB1";

mcpwm4.$name                                     = "PWM_CH3";
mcpwm4.mcpwmBase                                 = "MCPWM2";
mcpwm4.pinList                                   = ["2A"];
mcpwm4.enablePWM1B                               = false;
mcpwm4.enablePWM1A                               = false;
mcpwm4.enablePWM2B                               = false;
mcpwm4.enablePWM3A                               = false;
mcpwm4.enablePWM3B                               = false;
mcpwm4.timeBase.$name                            = "drivers_mcpwm_v0_mcpwm_timeBase3";
mcpwm4.timeBase.counterMode                      = "DL_MCPWM_COUNTER_MODE_UP";
mcpwm4.timeBase.emulationMode                    = "DL_MCPWM_EMULATION_FREE_RUN";
mcpwm4.counterCompare.$name                      = "drivers_mcpwm_v0_mcpwm_counterCompare3";
mcpwm4.actionQualifier.$name                     = "drivers_mcpwm_v0_mcpwm_actionQualifier3";
mcpwm4.actionQualifier.PWM2A.$name               = "drivers_mcpwm_v0_mcpwm_actionQualifierEvents4";
mcpwm4.actionQualifier.PWM2A.actionAtZero        = "DL_MCPWM_AQ_OUTPUT_HIGH";
mcpwm4.actionQualifier.PWM2A.actionAtCountUpCmpA = "DL_MCPWM_AQ_OUTPUT_LOW";
mcpwm4.loadMode.$name                            = "drivers_mcpwm_v0_mcpwm_loadMode3";
mcpwm4.peripheral["2A"].$assign                  = "PB2";

mcpwm5.$name                                     = "HSADC_TRIGGER_PWM";
mcpwm5.mcpwmBase                                 = "MCPWM1";
mcpwm5.pinList                                   = ["1A"];
mcpwm5.enablePWM1B                               = false;
mcpwm5.enablePWM2A                               = false;
mcpwm5.enablePWM2B                               = false;
mcpwm5.enablePWM3A                               = false;
mcpwm5.enablePWM3B                               = false;
mcpwm5.enableEventTrigger                        = true;
mcpwm5.timeBase.$name                            = "drivers_mcpwm_v0_mcpwm_timeBase4";
mcpwm5.timeBase.counterMode                      = "DL_MCPWM_COUNTER_MODE_UP";
mcpwm5.timeBase.periodValue                      = 9999;
mcpwm5.timeBase.emulationMode                    = "DL_MCPWM_EMULATION_FREE_RUN";
mcpwm5.counterCompare.$name                      = "drivers_mcpwm_v0_mcpwm_counterCompare4";
mcpwm5.actionQualifier.$name                     = "drivers_mcpwm_v0_mcpwm_actionQualifier4";
mcpwm5.actionQualifier.PWM1A.$name               = "drivers_mcpwm_v0_mcpwm_actionQualifierEvents1";
mcpwm5.actionQualifier.PWM1A.actionAtZero        = "DL_MCPWM_AQ_OUTPUT_HIGH";
mcpwm5.actionQualifier.PWM1A.actionAtCountUpCmpA = "DL_MCPWM_AQ_OUTPUT_LOW";
mcpwm5.loadMode.$name                            = "drivers_mcpwm_v0_mcpwm_loadMode4";
mcpwm5.eventTrigger.$name                        = "drivers_mcpwm_v0_mcpwm_eventTrigger0";
mcpwm5.eventTrigger.SOCA_enable                  = true;
mcpwm5.eventTrigger.SOCA_eventSource             = "DL_MCPWM_SOC_TBCTR_ZERO";

spi1.$name                              = "SPI_COMMON";
spi1.targetBitRate                      = 100000;
spi1.rxFifoThreshold                    = "DL_SPI_RX_FIFO_LEVEL_NOT_EMPTY";
spi1.txFifoThreshold                    = "DL_SPI_TX_FIFO_LEVEL_EMPTY";
spi1.frameFormat                        = "MOTO3";
spi1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
spi1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi1.sclkPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig4";
spi1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
spi1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
spi1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi1.mosiPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig5";
spi1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi1.misoPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig6";
spi1.peripheral.$assign                 = "UC3";
spi1.peripheral.sclkPin.$assign         = "PB18";
spi1.peripheral.mosiPin.$assign         = "PB10";
spi1.peripheral.misoPin.$assign         = "PA20";

