PatrickAJoseph/testbench/firmware/testbench/example.syscfg
spi2.$name                              = "IOEXP_SPI";
spi2.frameFormat                        = "MOTO3";
spi2.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
spi2.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi2.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi2.sclkPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig9";
spi2.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
spi2.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
spi2.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi2.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi2.mosiPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig10";
spi2.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
spi2.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
spi2.misoPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig11";
spi2.peripheral.$assign                 = "UC1";
spi2.peripheral.sclkPin.$assign         = "PA3";
spi2.peripheral.mosiPin.$assign         = "PA10";
spi2.peripheral.misoPin.$assign         = "PA28";

sysctl.useHFCLK     = true;
sysctl.SYSPLLSource = "DL_SYSCTL_SYSPLL_REF_HFCLK";
sysctl.SYSPLL_Qdiv  = 32;
sysctl.VREFSource   = "DL_SYSCTL_VREF_INTERNAL_3_3_V";

systick.periodEnable    = true;
systick.period          = 16777216;
systick.interruptEnable = true;
systick.registerInt     = true;
systick.systickEnable   = true;

timer1.$name              = "USER_TIMER";
timer1.timerPeriod        = "100000ns";
timer1.interrupts         = ["DL_TIMER_INTERRUPT_ZERO_EVENT"];
timer1.registerInterrupt  = true;
timer1.timerMode          = "DL_TIMER_TIMER_MODE_PERIODIC";
timer1.timerStartTimer    = true;
timer1.peripheral.$assign = "TIMG12_0";

uart1.$name                            = "RS485_UART";
uart1.targetBaudRate                   = 115200;
uart1.enabledInterrupts                = ["DL_UART_INTERRUPT_FRAMING_ERROR","DL_UART_INTERRUPT_OVERRUN_ERROR","DL_UART_INTERRUPT_PARITY_ERROR","DL_UART_INTERRUPT_RX"];
uart1.registerInterrupt                = true;
uart1.peripheral.$assign               = "UC4";
uart1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
uart1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
uart1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
uart1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
uart1.txPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig0";
uart1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
uart1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
uart1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
uart1.rxPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig1";

uart2.$name                            = "USER_UART";
uart2.targetBaudRate                   = 115200;
uart2.registerInterrupt                = true;
uart2.enabledInterrupts                = ["DL_UART_INTERRUPT_FRAMING_ERROR","DL_UART_INTERRUPT_OVERRUN_ERROR","DL_UART_INTERRUPT_PARITY_ERROR","DL_UART_INTERRUPT_RX"];
uart2.peripheral.$assign               = "UC0";
uart2.peripheral.rxPin.$assign         = "PA27";
uart2.peripheral.txPin.$assign         = "PA21";
uart2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
uart2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
uart2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
uart2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
uart2.txPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig2";
uart2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
uart2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
uart2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
uart2.rxPinConfig.$name                = "drivers_gpio_v0_gpioPinConfig3";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.SOC0.peripheral.$suggestSolution        = "ANALOG";
adc1.SOC0.peripheral.AIN16.$suggestSolution  = "PA16";
adc1.SOC1.peripheral.$suggestSolution        = "ANALOG";
adc1.SOC1.peripheral.AIN17.$suggestSolution  = "PA17";
gpio1.associatedPins[0].pin.$suggestSolution = "PA2";
gpio2.associatedPins[0].pin.$suggestSolution = "PB12";
gpio2.associatedPins[1].pin.$suggestSolution = "PB11";
i2c2.peripheral.sdaPin.$suggestSolution      = "PB7";
i2c2.peripheral.sclPin.$suggestSolution      = "PB6";
mcpwm1.peripheral.$suggestSolution           = "MCPWM0";
mcpwm3.peripheral.$suggestSolution           = "MCPWM3";
mcpwm4.peripheral.$suggestSolution           = "MCPWM2";
mcpwm5.peripheral.$suggestSolution           = "MCPWM1";
mcpwm5.peripheral["1A"].$suggestSolution     = "PA15";
sysctl.peripheral.$suggestSolution           = "SYSCTL";
sysctl.peripheral.x1Pin.$suggestSolution     = "PC16_X1";
sysctl.peripheral.x2Pin.$suggestSolution     = "PC17_X2";
uart1.peripheral.rxPin.$suggestSolution      = "PA1";
uart1.peripheral.txPin.$suggestSolution      = "PA0";
